 # Создал фабрику для Ролей доступа (Role)
Factory.define :role do |r| end

###################################################################################################
# Роли (Набор Груповых политик без ограничения по времени и кол-ву доступа)
###################################################################################################

Factory.define :page_manager_role, :class => Role do |r|
  policy= {
    :pages=>{
      :tree=>true,
      :manager=>true
    },
    :blocked=>{
      :yes=>false,
      :no=>true
    }
  }
  r.name   'self_page_manager'
  r.title 'Редактор своих страниц'
  r.description 'Правовой набор пользователя, который может редактировать свои страницы'
  r.settings(policy.to_yaml)
end


